Эвотор/src/InformationRegisters/Эвотор_Заказы/Эвотор_Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Эвотор_Заказы</name>
  <resources>
    <name>Выгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Эвотор/src/InformationRegisters/Эвотор_Заказы/ManagerModule.bsl
Процедура ДобавитьЗапись(ЗаказПокупателя) Экспорт
	
	НаборЗаписей = РегистрыСведений.Эвотор_Заказы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
	НаборЗаписей.Прочитать();	

	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаписьНабора = НаборЗаписей[0];
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
	КонецЕсли;
	
	ЗаписьНабора.ЗаказПокупателя = ЗаказПокупателя;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ДобавитьЗаписьВыгружен(ЗаказПокупателя) Экспорт
	
	НаборЗаписей = РегистрыСведений.Эвотор_Заказы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
	НаборЗаписей.Прочитать();	

	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаписьНабора = НаборЗаписей[0];
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
	КонецЕсли;
	
	ЗаписьНабора.ЗаказПокупателя = ЗаказПокупателя;
	ЗаписьНабора.Выгружен = Истина;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ДобавитьЗаписьОплачен(ЗаказПокупателя) Экспорт
	
	НаборЗаписей = РегистрыСведений.Эвотор_Заказы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
	НаборЗаписей.Прочитать();	

	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаписьНабора = НаборЗаписей[0];
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
	КонецЕсли;
	
	ЗаписьНабора.ЗаказПокупателя = ЗаказПокупателя;
	ЗаписьНабора.Оплачен = Истина;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
